kasir-ci4/app/Models/ModelKategori.php

   public function AllData()
   {
    return $this->db->table('tbl_kategori')
    ->get()
    ->getResultArray();
---
SELECT *
FROM `tbl_kategori`