kasir-ci4/app/Models/ModelSatuan.php

SELECT *
FROM `tbl_satuan`
---
   public function AllData()
   {
    return $this->db->table('tbl_satuan')
    ->get()
    ->getResultArray();