kasir-ci4/app/Models/ModelLaporan.php

  public function DataHarian($tgl)
  {
    return $this->db->table('tbl_rinci_jual')
    ->join('tbl_produk', 'tbl_produk.kode_produk=tbl_rinci_jual.kode_produk')
    ->join('tbl_jual', 'tbl_jual.no_faktur=tbl_rinci_jual.no_faktur')
    ->where('tbl_jual.tgl_jual', $tgl)
    ->select('tbl_rinci_jual.kode_produk')
    ->select('tbl_produk.nama_produk')
    ->select('tbl_rinci_jual.modal')
    ->select('tbl_rinci_jual.harga')
    ->groupBy('tbl_rinci_jual.kode_produk')
    ->selectSum('tbl_rinci_jual.qty')
    ->selectSum('tbl_rinci_jual.total_harga')
    ->get()->getResultArray();
---
SELECT `tbl_rinci_jual`.`kode_produk`, `tbl_produk`.`nama_produk`, `tbl_rinci_jual`.`modal`, `tbl_rinci_jual`.`harga`, SUM(`tbl_rinci_jual`.`qty`) AS `qty`, SUM(`tbl_rinci_jual`.`total_harga`) AS `total_harga`
FROM `tbl_rinci_jual`
JOIN `tbl_produk` ON `tbl_produk`.`kode_produk`=`tbl_rinci_jual`.`kode_produk`
JOIN `tbl_jual` ON `tbl_jual`.`no_faktur`=`tbl_rinci_jual`.`no_faktur`
WHERE `tbl_jual`.`tgl_jual` = '2024-02-26'
GROUP BY `tbl_rinci_jual`.`kode_produk`