kasir-ci4/app/Models/ModelProduk.php

SELECT *
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_produk`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_produk`.`id_satuan`
ORDER BY `id_produk` DESC
---
   public function AllData()
   {
    return $this->db->table('tbl_produk')
    ->join('tbl_kategori', 'tbl_kategori.id_kategori=tbl_produk.id_kategori')
    ->join('tbl_satuan', 'tbl_satuan.id_satuan=tbl_produk.id_satuan')
    ->orderBy('id_produk', 'DESC')
    ->get()
    ->getResultArray();

INSERT INTO `tbl_produk` (`kode_produk`, `nama_produk`, `id_kategori`, `id_satuan`, `harga_beli`, `harga_jual`, `stok`) VALUES ('1120', 'penghapus', '5', '1', '40000', '2000', '5')
---
   public function InsertData($data)
   {
$this->db->table('tbl_produk')->insert($data);